window.TRA_HISTORY = {
  "2026": {
  "臺東": {
    total: 39,
    byType: {
        "自強號": 6,
        "自強號(新)": 3,
        "普悠瑪": 5,
        "新自強": 5,
        "莒光號": 1,
        "區間車": 19
    }
  },
  "山里": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "鹿野": {
    total: 33,
    byType: {
        "自強號": 6,
        "自強號(新)": 3,
        "普悠瑪": 2,
        "新自強": 2,
        "莒光號": 1,
        "區間車": 19
    }
  },
  "瑞源": {
    total: 20,
    byType: {
        "自強號": 1,
        "區間車": 19
    }
  },
  "瑞和": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "關山": {
    total: 33,
    byType: {
        "自強號": 4,
        "自強號(新)": 3,
        "普悠瑪": 3,
        "新自強": 3,
        "莒光號": 1,
        "區間車": 19
    }
  },
  "海端": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "池上": {
    total: 35,
    byType: {
        "自強號": 6,
        "自強號(新)": 3,
        "普悠瑪": 3,
        "新自強": 3,
        "莒光號": 1,
        "區間車": 19
    }
  },
  "富里": {
    total: 26,
    byType: {
        "自強號": 4,
        "自強號(新)": 1,
        "新自強": 1,
        "莒光號": 1,
        "區間車": 19
    }
  },
  "東竹": {
    total: 20,
    byType: {
        "自強號": 1,
        "區間車": 19
    }
  },
  "東里": {
    total: 20,
    byType: {
        "自強號": 1,
        "區間車": 19
    }
  },
  "玉里": {
    total: 51,
    byType: {
        "自強號": 6,
        "自強號(新)": 3,
        "普悠瑪": 5,
        "新自強": 5,
        "莒光號": 1,
        "區間車": 30,
        "區間快": 1
    }
  },
  "三民": {
    total: 29,
    byType: {
        "區間車": 29
    }
  },
  "瑞穗": {
    total: 46,
    byType: {
        "自強號": 6,
        "自強號(新)": 3,
        "普悠瑪": 2,
        "新自強": 4,
        "莒光號": 1,
        "區間車": 29,
        "區間快": 1
    }
  },
  "富源": {
    total: 31,
    byType: {
        "自強號": 1,
        "自強號(新)": 1,
        "區間車": 29
    }
  },
  "光復": {
    total: 45,
    byType: {
        "自強號": 4,
        "自強號(新)": 3,
        "普悠瑪": 3,
        "新自強": 3,
        "莒光號": 1,
        "區間車": 30,
        "區間快": 1
    }
  },
  "萬榮": {
    total: 34,
    byType: {
        "自強號": 1,
        "自強號(新)": 1,
        "莒光號": 1,
        "區間車": 30,
        "區間快": 1
    }
  },
  "鳳林": {
    total: 47,
    byType: {
        "自強號": 4,
        "自強號(新)": 3,
        "普悠瑪": 5,
        "新自強": 2,
        "莒光號": 1,
        "區間車": 30,
        "區間快": 2
    }
  },
  "南平": {
    total: 30,
    byType: {
        "區間車": 30
    }
  },
  "林榮新光": {
    total: 33,
    byType: {
        "自強號": 4,
        "普悠瑪": 1,
        "莒光號": 1,
        "區間車": 27
    }
  },
  "豐田": {
    total: 31,
    byType: {
        "自強號": 1,
        "區間車": 30
    }
  },
  "壽豐": {
    total: 47,
    byType: {
        "自強號": 4,
        "自強號(新)": 3,
        "普悠瑪": 5,
        "新自強": 2,
        "莒光號": 1,
        "區間車": 30,
        "區間快": 2
    }
  },
  "平和": {
    total: 30,
    byType: {
        "區間車": 30
    }
  },
  "志學": {
    total: 40,
    byType: {
        "自強號": 3,
        "自強號(新)": 1,
        "普悠瑪": 3,
        "新自強": 1,
        "區間車": 30,
        "區間快": 2
    }
  },
  "吉安": {
    total: 44,
    byType: {
        "自強號": 4,
        "自強號(新)": 3,
        "普悠瑪": 3,
        "新自強": 1,
        "莒光號": 1,
        "區間車": 30,
        "區間快": 2
    }
  },
  "花蓮": {
    total: 93,
    byType: {
        "自強號": 8,
        "自強號(新)": 5,
        "普悠瑪": 16,
        "新自強": 6,
        "莒光號": 5,
        "區間車": 38,
        "區間快": 15
    }
  },
  "北埔": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "景美": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "新城": {
    total: 41,
    byType: {
        "自強號": 4,
        "自強號(新)": 1,
        "莒光號": 4,
        "區間車": 19,
        "區間快": 13
    }
  },
  "崇德": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "和仁": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "和平": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "漢本": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "武塔": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "南澳": {
    total: 45,
    byType: {
        "自強號": 5,
        "自強號(新)": 1,
        "莒光號": 5,
        "區間車": 19,
        "區間快": 15
    }
  },
  "東澳": {
    total: 27,
    byType: {
        "自強號": 2,
        "區間車": 19,
        "區間快": 6
    }
  },
  "蘇澳": {
    total: 51,
    byType: {
        "自強號": 5,
        "復興號": 2,
        "區間車": 40,
        "區間快": 4
    }
  },
  "永樂": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "蘇澳新": {
    total: 79,
    byType: {
        "自強號": 6,
        "自強號(新)": 1,
        "莒光號": 5,
        "復興號": 2,
        "區間車": 49,
        "區間快": 16
    }
  },
  "冬山": {
    total: 48,
    byType: {
        "莒光號": 2,
        "復興號": 2,
        "區間車": 38,
        "區間快": 6
    }
  },
  "羅東": {
    total: 89,
    byType: {
        "自強號": 6,
        "自強號(新)": 5,
        "普悠瑪": 11,
        "新自強": 3,
        "莒光號": 5,
        "復興號": 3,
        "區間車": 38,
        "區間快": 18
    }
  },
  "中里": {
    total: 38,
    byType: {
        "區間車": 38
    }
  },
  "二結": {
    total: 38,
    byType: {
        "區間車": 38
    }
  },
  "宜蘭": {
    total: 92,
    byType: {
        "自強號": 6,
        "自強號(新)": 5,
        "普悠瑪": 13,
        "新自強": 4,
        "莒光號": 5,
        "復興號": 3,
        "區間車": 38,
        "區間快": 18
    }
  },
  "礁溪": {
    total: 75,
    byType: {
        "自強號": 6,
        "自強號(新)": 4,
        "普悠瑪": 3,
        "莒光號": 4,
        "復興號": 3,
        "區間車": 37,
        "區間快": 18
    }
  },
  "頂埔": {
    total: 37,
    byType: {
        "區間車": 37
    }
  },
  "頭城": {
    total: 73,
    byType: {
        "自強號": 4,
        "自強號(新)": 4,
        "普悠瑪": 3,
        "莒光號": 4,
        "復興號": 3,
        "區間車": 37,
        "區間快": 18
    }
  },
  "外澳": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "龜山": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大溪": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大里": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "石城": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "福隆": {
    total: 38,
    byType: {
        "莒光號": 2,
        "復興號": 2,
        "區間車": 23,
        "區間快": 11
    }
  },
  "雙溪": {
    total: 51,
    byType: {
        "自強號": 4,
        "自強號(新)": 1,
        "莒光號": 3,
        "復興號": 3,
        "區間車": 23,
        "區間快": 17
    }
  },
  "猴硐": {
    total: 30,
    byType: {
        "莒光號": 1,
        "復興號": 1,
        "區間車": 23,
        "區間快": 5
    }
  },
  "瑞芳": {
    total: 66,
    byType: {
        "自強號": 8,
        "自強號(新)": 5,
        "莒光號": 4,
        "復興號": 5,
        "區間車": 23,
        "區間快": 21
    }
  },
  "基隆": {
    total: 81,
    byType: {
        "自強號": 5,
        "新自強": 1,
        "區間車": 64,
        "區間快": 11
    }
  },
  "三坑": {
    total: 64,
    byType: {
        "區間車": 64
    }
  },
  "八堵": {
    total: 127,
    byType: {
        "自強號": 10,
        "普悠瑪": 2,
        "莒光號": 2,
        "復興號": 4,
        "區間車": 87,
        "區間快": 22
    }
  },
  "七堵": {
    total: 153,
    byType: {
        "自強號": 22,
        "新自強": 1,
        "自強號(新)": 5,
        "莒光號": 4,
        "復興號": 3,
        "區間車": 88,
        "區間快": 30
    }
  },
  "百福": {
    total: 84,
    byType: {
        "區間車": 84
    }
  },
  "汐止": {
    total: 119,
    byType: {
        "自強號": 4,
        "莒光號": 3,
        "區間車": 84,
        "區間快": 27,
        "復興號": 1
    }
  },
  "汐科": {
    total: 89,
    byType: {
        "區間車": 84,
        "區間快": 5
    }
  },
  "南港": {
    total: 120,
    byType: {
        "自強號": 2,
        "自強號(新)": 3,
        "新自強": 7,
        "普悠瑪": 9,
        "區間車": 85,
        "區間快": 14
    }
  },
  "松山": {
    total: 170,
    byType: {
        "自強號": 21,
        "新自強": 7,
        "自強號(新)": 5,
        "普悠瑪": 13,
        "莒光號": 4,
        "區間車": 83,
        "區間快": 36,
        "復興號": 1
    }
  },
  "臺北": {
    total: 184,
    byType: {
        "自強號": 25,
        "新自強": 10,
        "自強號(新)": 5,
        "普悠瑪": 16,
        "莒光號": 4,
        "復興號": 5,
        "區間車": 83,
        "區間快": 36
    }
  },
  "萬華": {
    total: 172,
    byType: {
        "自強號": 23,
        "新自強": 7,
        "自強號(新)": 5,
        "普悠瑪": 14,
        "莒光號": 4,
        "區間車": 83,
        "區間快": 35,
        "復興號": 1
    }
  },
  "板橋": {
    total: 178,
    byType: {
        "自強號": 23,
        "新自強": 8,
        "自強號(新)": 5,
        "普悠瑪": 15,
        "莒光號": 4,
        "復興號": 5,
        "區間車": 83,
        "區間快": 35
    }
  },
  "浮洲": {
    total: 82,
    byType: {
        "區間車": 82
    }
  },
  "樹林": {
    total: 142,
    byType: {
        "自強號": 6,
        "自強號(新)": 1,
        "普悠瑪": 6,
        "新自強": 3,
        "莒光號": 4,
        "復興號": 4,
        "區間車": 83,
        "區間快": 35
    }
  },
  "山佳": {
    total: 67,
    byType: {
        "區間車": 67
    }
  },
  "鶯歌": {
    total: 81,
    byType: {
        "區間車": 67,
        "區間快": 14
    }
  },
  "鳳鳴": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "桃園": {
    total: 131,
    byType: {
        "自強號": 20,
        "自強號(新)": 5,
        "普悠瑪": 6,
        "新自強": 2,
        "莒光號": 1,
        "復興號": 4,
        "區間車": 67,
        "區間快": 26
    }
  },
  "內壢": {
    total: 76,
    byType: {
        "區間車": 67,
        "區間快": 9
    }
  },
  "中壢": {
    total: 120,
    byType: {
        "自強號": 17,
        "自強號(新)": 4,
        "莒光號": 1,
        "復興號": 4,
        "區間車": 67,
        "區間快": 26,
        "普悠瑪": 1
    }
  },
  "埔心": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "楊梅": {
    total: 97,
    byType: {
        "自強號": 2,
        "莒光號": 1,
        "復興號": 4,
        "區間車": 66,
        "區間快": 24
    }
  },
  "富岡": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "北湖": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "湖口": {
    total: 93,
    byType: {
        "莒光號": 1,
        "復興號": 4,
        "區間車": 65,
        "區間快": 23
    }
  },
  "新豐": {
    total: 65,
    byType: {
        "區間車": 65
    }
  },
  "竹北": {
    total: 94,
    byType: {
        "自強號": 3,
        "莒光號": 1,
        "區間車": 65,
        "區間快": 24,
        "復興號": 1
    }
  },
  "新竹": {
    total: 152,
    byType: {
        "自強號": 20,
        "新自強": 4,
        "自強號(新)": 5,
        "普悠瑪": 7,
        "莒光號": 1,
        "區間車": 89,
        "區間快": 25,
        "復興號": 1
    }
  },
  "香山": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "崎頂": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "竹南": {
    total: 102,
    byType: {
        "自強號": 17,
        "自強號(新)": 4,
        "莒光號": 1,
        "區間車": 62,
        "區間快": 15,
        "新自強": 1,
        "普悠瑪": 1,
        "復興號": 1
    }
  },
  "談文": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大山": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "後龍": {
    total: 30,
    byType: {
        "新自強": 1,
        "普悠瑪": 1,
        "自強號": 4,
        "區間快": 1,
        "區間車": 22,
        "復興號": 1
    }
  },
  "白沙屯": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "通宵": {
    total: 29,
    byType: {
        "新自強": 1,
        "普悠瑪": 1,
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1
    }
  },
  "苑裡": {
    total: 29,
    byType: {
        "新自強": 1,
        "普悠瑪": 1,
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1
    }
  },
  "日南": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "大甲": {
    total: 30,
    byType: {
        "新自強": 1,
        "普悠瑪": 1,
        "自強號": 4,
        "區間快": 1,
        "區間車": 22,
        "復興號": 1
    }
  },
  "台中港": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "清水": {
    total: 29,
    byType: {
        "新自強": 1,
        "普悠瑪": 1,
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1
    }
  },
  "沙鹿": {
    total: 29,
    byType: {
        "新自強": 1,
        "普悠瑪": 1,
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1
    }
  },
  "大肚": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "追分": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "造橋": {
    total: 39,
    byType: {
        "區間車": 39
    }
  },
  "苗栗": {
    total: 85,
    byType: {
        "自強號": 14,
        "自強號(新)": 5,
        "普悠瑪": 3,
        "新自強": 1,
        "莒光號": 1,
        "區間車": 40,
        "區間快": 21
    }
  },
  "銅鑼": {
    total: 44,
    byType: {
        "區間車": 39,
        "區間快": 5
    }
  },
  "三義": {
    total: 44,
    byType: {
        "區間車": 39,
        "區間快": 5
    }
  },
  "后里": {
    total: 89,
    byType: {
        "自強號": 2,
        "自強號(新)": 1,
        "莒光號": 1,
        "區間車": 64,
        "區間快": 21
    }
  },
  "豐原": {
    total: 114,
    byType: {
        "自強號": 15,
        "自強號(新)": 5,
        "普悠瑪": 8,
        "新自強": 1,
        "莒光號": 1,
        "區間車": 63,
        "區間快": 21
    }
  },
  "栗林": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "潭子": {
    total: 69,
    byType: {
        "區間車": 62,
        "區間快": 7
    }
  },
  "松竹": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "太原": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "臺中": {
    total: 125,
    byType: {
        "自強號": 21,
        "新自強": 6,
        "自強號(新)": 5,
        "普悠瑪": 9,
        "莒光號": 1,
        "區間車": 62,
        "區間快": 21
    }
  },
  "五權": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "大慶": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "新烏日": {
    total: 86,
    byType: {
        "自強號": 3,
        "自強號(新)": 3,
        "莒光號": 1,
        "區間車": 61,
        "區間快": 18
    }
  },
  "彰化": {
    total: 150,
    byType: {
        "自強號": 23,
        "新自強": 3,
        "自強號(新)": 5,
        "普悠瑪": 10,
        "莒光號": 1,
        "區間車": 83,
        "區間快": 24,
        "復興號": 1
    }
  },
  "花壇": {
    total: 60,
    byType: {
        "區間車": 60
    }
  },
  "大村": {
    total: 60,
    byType: {
        "區間車": 60
    }
  },
  "員林": {
    total: 97,
    byType: {
        "自強號": 16,
        "自強號(新)": 3,
        "普悠瑪": 1,
        "新自強": 1,
        "區間車": 60,
        "區間快": 16
    }
  },
  "永靖": {
    total: 60,
    byType: {
        "區間車": 60
    }
  },
  "社頭": {
    total: 61,
    byType: {
        "區間車": 60,
        "區間快": 1
    }
  },
  "田中": {
    total: 77,
    byType: {
        "自強號": 2,
        "自強號(新)": 1,
        "區間車": 60,
        "區間快": 14
    }
  },
  "二水": {
    total: 76,
    byType: {
        "區間車": 68,
        "區間快": 8
    }
  },
  "林內": {
    total: 49,
    byType: {
        "區間車": 49
    }
  },
  "石榴": {
    total: 49,
    byType: {
        "區間車": 49
    }
  },
  "斗六": {
    total: 84,
    byType: {
        "自強號": 17,
        "自強號(新)": 3,
        "普悠瑪": 1,
        "區間車": 49,
        "區間快": 14
    }
  },
  "斗南": {
    total: 68,
    byType: {
        "自強號": 6,
        "自強號(新)": 1,
        "區間車": 47,
        "區間快": 14
    }
  },
  "石龜": {
    total: 46,
    byType: {
        "區間車": 46
    }
  },
  "大林": {
    total: 46,
    byType: {
        "區間車": 46
    }
  },
  "民雄": {
    total: 60,
    byType: {
        "區間車": 46,
        "區間快": 14
    }
  },
  "嘉北": {
    total: 46,
    byType: {
        "區間車": 46
    }
  },
  "嘉義": {
    total: 99,
    byType: {
        "自強號": 22,
        "新自強": 4,
        "自強號(新)": 3,
        "普悠瑪": 1,
        "區間車": 55,
        "區間快": 14
    }
  },
  "水上": {
    total: 43,
    byType: {
        "區間車": 43
    }
  },
  "南靖": {
    total: 43,
    byType: {
        "區間車": 43
    }
  },
  "後壁": {
    total: 43,
    byType: {
        "區間車": 43
    }
  },
  "新營": {
    total: 75,
    byType: {
        "自強號": 17,
        "自強號(新)": 3,
        "區間車": 43,
        "區間快": 12
    }
  },
  "柳營": {
    total: 43,
    byType: {
        "區間車": 43
    }
  },
  "林鳳營": {
    total: 43,
    byType: {
        "區間車": 43
    }
  },
  "隆田": {
    total: 43,
    byType: {
        "區間車": 43
    }
  },
  "拔林": {
    total: 43,
    byType: {
        "區間車": 43
    }
  },
  "善化": {
    total: 61,
    byType: {
        "自強號": 6,
        "區間車": 43,
        "區間快": 12
    }
  },
  "永康": {
    total: 57,
    byType: {
        "自強號": 2,
        "區間車": 43,
        "區間快": 12
    }
  },
  "臺南": {
    total: 106,
    byType: {
        "自強號": 23,
        "新自強": 5,
        "自強號(新)": 3,
        "普悠瑪": 1,
        "區間車": 62,
        "區間快": 12
    }
  },
  "岡山": {
    total: 77,
    byType: {
        "自強號": 3,
        "自強號(新)": 1,
        "區間車": 61,
        "區間快": 12
    }
  },
  "新左營": {
    total: 113,
    byType: {
        "自強號": 18,
        "新自強": 1,
        "自強號(新)": 3,
        "普悠瑪": 1,
        "區間車": 78,
        "區間快": 12
    }
  },
  "高雄": {
    total: 115,
    byType: {
        "自強號": 23,
        "新自強": 5,
        "自強號(新)": 3,
        "普悠瑪": 1,
        "區間車": 71,
        "區間快": 12
    }
  },
  "鳳山": {
    total: 102,
    byType: {
        "自強號": 16,
        "自強號(新)": 3,
        "區間車": 72,
        "區間快": 11
    }
  },
  "九曲堂": {
    total: 72,
    byType: {
        "區間車": 72
    }
  },
  "屏東": {
    total: 117,
    byType: {
        "自強號": 22,
        "新自強": 5,
        "自強號(新)": 3,
        "普悠瑪": 1,
        "區間車": 75,
        "區間快": 11
    }
  },
  "西勢": {
    total: 73,
    byType: {
        "區間車": 73
    }
  },
  "潮州": {
    total: 110,
    byType: {
        "自強號": 17,
        "新自強": 5,
        "自強號(新)": 3,
        "普悠瑪": 1,
        "區間車": 74,
        "區間快": 10
    }
  },
  "崁頂": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "南州": {
    total: 35,
    byType: {
        "自強號": 4,
        "自強號(新)": 1,
        "區間車": 28,
        "區間快": 2
    }
  },
  "鎮安": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "林邊": {
    total: 34,
    byType: {
        "自強號": 3,
        "自強號(新)": 1,
        "區間車": 28,
        "區間快": 2
    }
  },
  "佳冬": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "東海": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "枋寮": {
    total: 39,
    byType: {
        "自強號": 7,
        "自強號(新)": 1,
        "新自強": 1,
        "區間車": 28,
        "區間快": 2
    }
  }
},
  "2025.01": {
  "臺東": {
    total: 40,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 10
    }
  },
  "山里": {
    total: 18,
    byType: {
        "區間車": 18
    }
  },
  "鹿野": {
    total: 34,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 4
    }
  },
  "瑞源": {
    total: 20,
    byType: {
        "自強號": 2,
        "區間車": 18
    }
  },
  "瑞和": {
    total: 18,
    byType: {
        "區間車": 18
    }
  },
  "關山": {
    total: 34,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "海端": {
    total: 18,
    byType: {
        "區間車": 18
    }
  },
  "池上": {
    total: 36,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "富里": {
    total: 27,
    byType: {
        "自強號": 5,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 1
    }
  },
  "東竹": {
    total: 20,
    byType: {
        "自強號": 2,
        "區間車": 18
    }
  },
  "東里": {
    total: 20,
    byType: {
        "自強號": 2,
        "區間車": 18
    }
  },
  "玉里": {
    total: 52,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間快": 1,
        "區間車": 29,
        "莒光號": 3,
        "新自強": 10
    }
  },
  "三民": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "瑞穗": {
    total: 47,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間快": 1,
        "區間車": 28,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "富源": {
    total: 30,
    byType: {
        "自強號": 2,
        "區間車": 28
    }
  },
  "光復": {
    total: 46,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 1,
        "區間車": 29,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "萬榮": {
    total: 34,
    byType: {
        "自強號": 2,
        "區間快": 1,
        "區間車": 29,
        "莒光號": 2
    }
  },
  "鳳林": {
    total: 48,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 3,
        "普悠瑪": 3,
        "新自強": 4
    }
  },
  "南平": {
    total: 29,
    byType: {
        "區間車": 29
    }
  },
  "林榮新光": {
    total: 33,
    byType: {
        "自強號": 4,
        "區間車": 27,
        "莒光號": 1,
        "新自強": 1
    }
  },
  "豐田": {
    total: 30,
    byType: {
        "自強號": 1,
        "區間車": 29
    }
  },
  "壽豐": {
    total: 48,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 3,
        "普悠瑪": 3,
        "新自強": 4
    }
  },
  "平和": {
    total: 29,
    byType: {
        "區間車": 29
    }
  },
  "志學": {
    total: 40,
    byType: {
        "自強號": 4,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 1,
        "普悠瑪": 3,
        "新自強": 1
    }
  },
  "吉安": {
    total: 45,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 3,
        "普悠瑪": 3,
        "新自強": 1
    }
  },
  "花蓮": {
    total: 93,
    byType: {
        "自強號": 10,
        "自強號(新)": 4,
        "區間快": 15,
        "區間車": 37,
        "莒光號": 5,
        "普悠瑪": 12,
        "新自強": 10
    }
  },
  "北埔": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "景美": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "新城": {
    total: 41,
    byType: {
        "自強號": 5,
        "區間快": 13,
        "區間車": 19,
        "莒光號": 4
    }
  },
  "崇德": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "和仁": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "和平": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "漢本": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "武塔": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "南澳": {
    total: 45,
    byType: {
        "自強號": 6,
        "區間快": 15,
        "區間車": 19,
        "莒光號": 5
    }
  },
  "東澳": {
    total: 27,
    byType: {
        "自強號": 2,
        "區間快": 6,
        "區間車": 19
    }
  },
  "蘇澳": {
    total: 51,
    byType: {
        "自強號": 5,
        "區間快": 4,
        "區間車": 40,
        "復興號": 2
    }
  },
  "永樂": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "蘇澳新": {
    total: 79,
    byType: {
        "自強號": 7,
        "區間快": 16,
        "區間車": 49,
        "莒光號": 5,
        "復興號": 2
    }
  },
  "冬山": {
    total: 48,
    byType: {
        "區間快": 6,
        "區間車": 38,
        "莒光號": 2,
        "復興號": 2
    }
  },
  "羅東": {
    total: 90,
    byType: {
        "自強號": 8,
        "自強號(新)": 4,
        "區間快": 18,
        "區間車": 38,
        "莒光號": 5,
        "復興號": 3,
        "普悠瑪": 10,
        "新自強": 4
    }
  },
  "中里": {
    total: 38,
    byType: {
        "區間車": 38
    }
  },
  "二結": {
    total: 38,
    byType: {
        "區間車": 38
    }
  },
  "宜蘭": {
    total: 93,
    byType: {
        "自強號": 8,
        "自強號(新)": 4,
        "區間快": 18,
        "區間車": 38,
        "莒光號": 5,
        "復興號": 3,
        "普悠瑪": 11,
        "新自強": 6
    }
  },
  "礁溪": {
    total: 75,
    byType: {
        "自強號": 8,
        "自強號(新)": 2,
        "區間快": 18,
        "區間車": 37,
        "莒光號": 4,
        "復興號": 3,
        "普悠瑪": 2,
        "新自強": 1
    }
  },
  "頂埔": {
    total: 37,
    byType: {
        "區間車": 37
    }
  },
  "頭城": {
    total: 73,
    byType: {
        "自強號": 6,
        "自強號(新)": 2,
        "區間快": 18,
        "區間車": 37,
        "莒光號": 4,
        "復興號": 3,
        "普悠瑪": 2,
        "新自強": 1
    }
  },
  "外澳": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "龜山": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大溪": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大里": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "石城": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "福隆": {
    total: 38,
    byType: {
        "區間快": 11,
        "區間車": 23,
        "莒光號": 2,
        "復興號": 2
    }
  },
  "雙溪": {
    total: 52,
    byType: {
        "自強號": 6,
        "區間快": 17,
        "區間車": 23,
        "莒光號": 3,
        "復興號": 3
    }
  },
  "猴硐": {
    total: 30,
    byType: {
        "區間快": 5,
        "區間車": 23,
        "莒光號": 1,
        "復興號": 1
    }
  },
  "瑞芳": {
    total: 67,
    byType: {
        "自強號": 10,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 23,
        "莒光號": 4,
        "復興號": 5
    }
  },
  "基隆": {
    total: 81,
    byType: {
        "自強號": 5,
        "區間快": 11,
        "區間車": 64,
        "普悠瑪": 1
    }
  },
  "三坑": {
    total: 64,
    byType: {
        "區間車": 64
    }
  },
  "八堵": {
    total: 128,
    byType: {
        "自強號": 11,
        "區間快": 22,
        "區間車": 87,
        "莒光號": 2,
        "復興號": 4,
        "普悠瑪": 2
    }
  },
  "七堵": {
    total: 151,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 30,
        "區間車": 88,
        "莒光號": 4,
        "復興號": 3
    }
  },
  "百福": {
    total: 84,
    byType: {
        "區間車": 84
    }
  },
  "汐止": {
    total: 117,
    byType: {
        "自強號": 2,
        "區間快": 27,
        "區間車": 84,
        "莒光號": 3,
        "復興號": 1
    }
  },
  "汐科": {
    total: 89,
    byType: {
        "區間快": 5,
        "區間車": 84
    }
  },
  "南港": {
    total: 121,
    byType: {
        "自強號": 2,
        "自強號(新)": 3,
        "區間快": 14,
        "區間車": 85,
        "普悠瑪": 9,
        "新自強": 8
    }
  },
  "松山": {
    total: 170,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 36,
        "區間車": 83,
        "莒光號": 4,
        "復興號": 1,
        "普悠瑪": 11,
        "新自強": 9
    }
  },
  "臺北": {
    total: 184,
    byType: {
        "自強號": 26,
        "自強號(新)": 4,
        "區間快": 36,
        "區間車": 83,
        "莒光號": 4,
        "復興號": 5,
        "普悠瑪": 16,
        "新自強": 10
    }
  },
  "萬華": {
    total: 172,
    byType: {
        "自強號": 24,
        "自強號(新)": 4,
        "區間快": 35,
        "區間車": 83,
        "莒光號": 4,
        "復興號": 1,
        "普悠瑪": 12,
        "新自強": 9
    }
  },
  "板橋": {
    total: 178,
    byType: {
        "自強號": 24,
        "自強號(新)": 4,
        "區間快": 35,
        "區間車": 83,
        "莒光號": 4,
        "復興號": 5,
        "普悠瑪": 14,
        "新自強": 9
    }
  },
  "浮洲": {
    total: 82,
    byType: {
        "區間車": 82
    }
  },
  "樹林": {
    total: 142,
    byType: {
        "自強號": 7,
        "區間快": 35,
        "區間車": 83,
        "莒光號": 4,
        "復興號": 4,
        "普悠瑪": 3,
        "新自強": 6
    }
  },
  "山佳": {
    total: 67,
    byType: {
        "區間車": 67
    }
  },
  "鶯歌": {
    total: 81,
    byType: {
        "區間快": 14,
        "區間車": 67
    }
  },
  "鳳鳴": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "桃園": {
    total: 131,
    byType: {
        "自強號": 21,
        "自強號(新)": 4,
        "區間快": 26,
        "區間車": 67,
        "莒光號": 1,
        "復興號": 4,
        "普悠瑪": 6,
        "新自強": 2
    }
  },
  "內壢": {
    total: 76,
    byType: {
        "區間快": 9,
        "區間車": 67
    }
  },
  "中壢": {
    total: 120,
    byType: {
        "自強號": 18,
        "自強號(新)": 3,
        "區間快": 26,
        "區間車": 67,
        "莒光號": 1,
        "復興號": 4,
        "新自強": 1
    }
  },
  "埔心": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "楊梅": {
    total: 97,
    byType: {
        "自強號": 2,
        "區間快": 24,
        "區間車": 66,
        "莒光號": 1,
        "復興號": 4
    }
  },
  "富岡": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "北湖": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "湖口": {
    total: 93,
    byType: {
        "區間快": 23,
        "區間車": 65,
        "莒光號": 1,
        "復興號": 4
    }
  },
  "新豐": {
    total: 65,
    byType: {
        "區間車": 65
    }
  },
  "竹北": {
    total: 94,
    byType: {
        "自強號": 3,
        "區間快": 24,
        "區間車": 65,
        "莒光號": 1,
        "復興號": 1
    }
  },
  "新竹": {
    total: 152,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 25,
        "區間車": 89,
        "莒光號": 1,
        "復興號": 1,
        "普悠瑪": 7,
        "新自強": 3
    }
  },
  "香山": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "崎頂": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "竹南": {
    total: 101,
    byType: {
        "自強號": 17,
        "自強號(新)": 3,
        "區間快": 15,
        "區間車": 62,
        "莒光號": 1,
        "復興號": 1,
        "新自強": 2
    }
  },
  "談文": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大山": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "後龍": {
    total: 30,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 22,
        "復興號": 1,
        "新自強": 2
    }
  },
  "白沙屯": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "通宵": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "苑裡": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "日南": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "大甲": {
    total: 30,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 22,
        "復興號": 1,
        "新自強": 2
    }
  },
  "台中港": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "清水": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "沙鹿": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "大肚": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "追分": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "造橋": {
    total: 39,
    byType: {
        "區間車": 39
    }
  },
  "苗栗": {
    total: 85,
    byType: {
        "自強號": 15,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 40,
        "莒光號": 1,
        "普悠瑪": 3,
        "新自強": 1
    }
  },
  "銅鑼": {
    total: 44,
    byType: {
        "區間快": 5,
        "區間車": 39
    }
  },
  "三義": {
    total: 44,
    byType: {
        "區間快": 5,
        "區間車": 39
    }
  },
  "后里": {
    total: 89,
    byType: {
        "自強號": 3,
        "區間快": 21,
        "區間車": 64,
        "莒光號": 1
    }
  },
  "豐原": {
    total: 114,
    byType: {
        "自強號": 15,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 63,
        "莒光號": 1,
        "普悠瑪": 8,
        "新自強": 2
    }
  },
  "栗林": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "潭子": {
    total: 69,
    byType: {
        "區間快": 7,
        "區間車": 62
    }
  },
  "松竹": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "太原": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "臺中": {
    total: 125,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 62,
        "莒光號": 1,
        "普悠瑪": 13,
        "新自強": 2
    }
  },
  "五權": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "大慶": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "新烏日": {
    total: 86,
    byType: {
        "自強號": 4,
        "自強號(新)": 2,
        "區間快": 18,
        "區間車": 61,
        "莒光號": 1
    }
  },
  "彰化": {
    total: 150,
    byType: {
        "自強號": 24,
        "自強號(新)": 4,
        "區間快": 24,
        "區間車": 83,
        "莒光號": 1,
        "復興號": 1,
        "普悠瑪": 9,
        "新自強": 4
    }
  },
  "員林": {
    total: 97,
    byType: {
        "自強號": 17,
        "自強號(新)": 2,
        "區間快": 16,
        "區間車": 60,
        "普悠瑪": 1,
        "新自強": 1
    }
  },
  "社頭": {
    total: 61,
    byType: {
        "區間快": 1,
        "區間車": 60
    }
  },
  "田中": {
    total: 77,
    byType: {
        "自強號": 3,
        "區間快": 14,
        "區間車": 60
    }
  },
  "二水": {
    total: 76,
    byType: {
        "區間快": 8,
        "區間車": 68
    }
  },
  "斗六": {
    total: 85,
    byType: {
        "自強號": 18,
        "自強號(新)": 2,
        "區間快": 14,
        "區間車": 50,
        "普悠瑪": 1
    }
  },
  "斗南": {
    total: 71,
    byType: {
        "自強號": 7,
        "區間快": 14,
        "區間車": 50
    }
  },
  "民雄": {
    total: 63,
    byType: {
        "區間快": 14,
        "區間車": 49
    }
  },
  "嘉義": {
    total: 101,
    byType: {
        "自強號": 23,
        "自強號(新)": 2,
        "區間快": 14,
        "區間車": 58,
        "普悠瑪": 4
    }
  },
  "新營": {
    total: 76,
    byType: {
        "自強號": 18,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 44
    }
  },
  "善化": {
    total: 62,
    byType: {
        "自強號": 6,
        "區間快": 12,
        "區間車": 44
    }
  },
  "永康": {
    total: 58,
    byType: {
        "自強號": 2,
        "區間快": 12,
        "區間車": 44
    }
  },
  "臺南": {
    total: 106,
    byType: {
        "自強號": 24,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 63,
        "普悠瑪": 5
    }
  },
  "岡山": {
    total: 77,
    byType: {
        "自強號": 4,
        "區間快": 12,
        "區間車": 61
    }
  },
  "新左營": {
    total: 113,
    byType: {
        "自強號": 20,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 78,
        "普悠瑪": 1
    }
  },
  "高雄": {
    total: 114,
    byType: {
        "自強號": 24,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 71,
        "普悠瑪": 5
    }
  },
  "鳳山": {
    total: 102,
    byType: {
        "自強號": 17,
        "自強號(新)": 2,
        "區間快": 11,
        "區間車": 72
    }
  },
  "九曲堂": {
    total: 72,
    byType: {
        "區間車": 72
    }
  },
  "屏東": {
    total: 116,
    byType: {
        "自強號": 23,
        "自強號(新)": 2,
        "區間快": 11,
        "區間車": 75,
        "普悠瑪": 5
    }
  },
  "西勢": {
    total: 74,
    byType: {
        "區間車": 74
    }
  },
  "潮州": {
    total: 110,
    byType: {
        "自強號": 18,
        "自強號(新)": 2,
        "區間快": 10,
        "區間車": 75,
        "普悠瑪": 5
    }
  },
  "崁頂": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "南州": {
    total: 35,
    byType: {
        "自強號": 5,
        "區間快": 2,
        "區間車": 28
    }
  },
  "鎮安": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "林邊": {
    total: 34,
    byType: {
        "自強號": 4,
        "區間快": 2,
        "區間車": 28
    }
  },
  "佳冬": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "東海": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "枋寮": {
    total: 39,
    byType: {
        "自強號": 8,
        "區間快": 2,
        "區間車": 28,
        "普悠瑪": 1
    }
  }
},
  "2024": {
  "臺東": {
    total: 40,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 10
    }
  },
  "山里": {
    total: 18,
    byType: {
        "區間車": 18
    }
  },
  "鹿野": {
    total: 34,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 4
    }
  },
  "瑞源": {
    total: 20,
    byType: {
        "自強號": 2,
        "區間車": 18
    }
  },
  "瑞和": {
    total: 18,
    byType: {
        "區間車": 18
    }
  },
  "關山": {
    total: 34,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "海端": {
    total: 18,
    byType: {
        "區間車": 18
    }
  },
  "池上": {
    total: 36,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "富里": {
    total: 27,
    byType: {
        "自強號": 5,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 1
    }
  },
  "東竹": {
    total: 20,
    byType: {
        "自強號": 2,
        "區間車": 18
    }
  },
  "東里": {
    total: 20,
    byType: {
        "自強號": 2,
        "區間車": 18
    }
  },
  "玉里": {
    total: 52,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間快": 1,
        "區間車": 29,
        "莒光號": 3,
        "新自強": 10
    }
  },
  "三民": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "瑞穗": {
    total: 47,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間快": 1,
        "區間車": 28,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "富源": {
    total: 30,
    byType: {
        "自強號": 2,
        "區間車": 28
    }
  },
  "光復": {
    total: 46,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 1,
        "區間車": 29,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "萬榮": {
    total: 34,
    byType: {
        "自強號": 2,
        "區間快": 1,
        "區間車": 29,
        "莒光號": 2
    }
  },
  "鳳林": {
    total: 48,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 3,
        "普悠瑪": 3,
        "新自強": 4
    }
  },
  "南平": {
    total: 29,
    byType: {
        "區間車": 29
    }
  },
  "林榮新光": {
    total: 33,
    byType: {
        "自強號": 4,
        "區間車": 27,
        "莒光號": 1,
        "新自強": 1
    }
  },
  "豐田": {
    total: 30,
    byType: {
        "自強號": 1,
        "區間車": 29
    }
  },
  "壽豐": {
    total: 48,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 3,
        "普悠瑪": 3,
        "新自強": 4
    }
  },
  "平和": {
    total: 29,
    byType: {
        "區間車": 29
    }
  },
  "志學": {
    total: 40,
    byType: {
        "自強號": 4,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 1,
        "普悠瑪": 3,
        "新自強": 1
    }
  },
  "吉安": {
    total: 45,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 3,
        "普悠瑪": 3,
        "新自強": 1
    }
  },
  "花蓮": {
    total: 93,
    byType: {
        "自強號": 10,
        "自強號(新)": 4,
        "區間快": 15,
        "區間車": 37,
        "莒光號": 5,
        "普悠瑪": 12,
        "新自強": 10
    }
  },
  "北埔": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "景美": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "新城": {
    total: 41,
    byType: {
        "自強號": 5,
        "區間快": 13,
        "區間車": 19,
        "莒光號": 4
    }
  },
  "崇德": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "和仁": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "和平": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "漢本": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "武塔": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "南澳": {
    total: 45,
    byType: {
        "自強號": 6,
        "區間快": 15,
        "區間車": 19,
        "莒光號": 5
    }
  },
  "東澳": {
    total: 27,
    byType: {
        "自強號": 2,
        "區間快": 6,
        "區間車": 19
    }
  },
  "蘇澳": {
    total: 51,
    byType: {
        "自強號": 5,
        "區間快": 4,
        "區間車": 40,
        "復興號": 2
    }
  },
  "永樂": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "蘇澳新": {
    total: 79,
    byType: {
        "自強號": 7,
        "區間快": 16,
        "區間車": 49,
        "莒光號": 5,
        "復興號": 2
    }
  },
  "冬山": {
    total: 48,
    byType: {
        "區間快": 6,
        "區間車": 38,
        "莒光號": 2,
        "復興號": 2
    }
  },
  "羅東": {
    total: 90,
    byType: {
        "自強號": 8,
        "自強號(新)": 4,
        "區間快": 18,
        "區間車": 38,
        "莒光號": 5,
        "復興號": 3,
        "普悠瑪": 10,
        "新自強": 4
    }
  },
  "中里": {
    total: 38,
    byType: {
        "區間車": 38
    }
  },
  "二結": {
    total: 38,
    byType: {
        "區間車": 38
    }
  },
  "宜蘭": {
    total: 93,
    byType: {
        "自強號": 8,
        "自強號(新)": 4,
        "區間快": 18,
        "區間車": 38,
        "莒光號": 5,
        "復興號": 3,
        "普悠瑪": 11,
        "新自強": 6
    }
  },
  "礁溪": {
    total: 75,
    byType: {
        "自強號": 8,
        "自強號(新)": 2,
        "區間快": 18,
        "區間車": 37,
        "莒光號": 4,
        "復興號": 3,
        "普悠瑪": 2,
        "新自強": 1
    }
  },
  "頂埔": {
    total: 37,
    byType: {
        "區間車": 37
    }
  },
  "頭城": {
    total: 73,
    byType: {
        "自強號": 6,
        "自強號(新)": 2,
        "區間快": 18,
        "區間車": 37,
        "莒光號": 4,
        "復興號": 3,
        "普悠瑪": 2,
        "新自強": 1
    }
  },
  "外澳": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "龜山": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大溪": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大里": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "石城": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "福隆": {
    total: 38,
    byType: {
        "區間快": 11,
        "區間車": 23,
        "莒光號": 2,
        "復興號": 2
    }
  },
  "雙溪": {
    total: 52,
    byType: {
        "自強號": 6,
        "區間快": 17,
        "區間車": 23,
        "莒光號": 3,
        "復興號": 3
    }
  },
  "猴硐": {
    total: 30,
    byType: {
        "區間快": 5,
        "區間車": 23,
        "莒光號": 1,
        "復興號": 1
    }
  },
  "瑞芳": {
    total: 67,
    byType: {
        "自強號": 10,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 23,
        "莒光號": 4,
        "復興號": 5
    }
  },
  "基隆": {
    total: 81,
    byType: {
        "自強號": 5,
        "區間快": 11,
        "區間車": 64,
        "普悠瑪": 1
    }
  },
  "三坑": {
    total: 64,
    byType: {
        "區間車": 64
    }
  },
  "八堵": {
    total: 128,
    byType: {
        "自強號": 11,
        "區間快": 22,
        "區間車": 87,
        "莒光號": 2,
        "復興號": 4,
        "普悠瑪": 2
    }
  },
  "七堵": {
    total: 151,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 30,
        "區間車": 88,
        "莒光號": 4,
        "復興號": 3
    }
  },
  "百福": {
    total: 84,
    byType: {
        "區間車": 84
    }
  },
  "汐止": {
    total: 117,
    byType: {
        "自強號": 2,
        "區間快": 27,
        "區間車": 84,
        "莒光號": 3,
        "復興號": 1
    }
  },
  "汐科": {
    total: 90,
    byType: {
        "區間快": 6,
        "區間車": 84
    }
  },
  "南港": {
    total: 121,
    byType: {
        "自強號": 2,
        "自強號(新)": 3,
        "區間快": 14,
        "區間車": 85,
        "普悠瑪": 9,
        "新自強": 8
    }
  },
  "松山": {
    total: 171,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 36,
        "區間車": 84,
        "莒光號": 4,
        "復興號": 1,
        "普悠瑪": 11,
        "新自強": 9
    }
  },
  "臺北": {
    total: 185,
    byType: {
        "自強號": 26,
        "自強號(新)": 4,
        "區間快": 36,
        "區間車": 84,
        "莒光號": 4,
        "復興號": 5,
        "普悠瑪": 16,
        "新自強": 10
    }
  },
  "萬華": {
    total: 173,
    byType: {
        "自強號": 24,
        "自強號(新)": 4,
        "區間快": 35,
        "區間車": 84,
        "莒光號": 4,
        "復興號": 1,
        "普悠瑪": 12,
        "新自強": 9
    }
  },
  "板橋": {
    total: 179,
    byType: {
        "自強號": 24,
        "自強號(新)": 4,
        "區間快": 35,
        "區間車": 84,
        "莒光號": 4,
        "復興號": 5,
        "普悠瑪": 14,
        "新自強": 9
    }
  },
  "浮洲": {
    total: 83,
    byType: {
        "區間車": 83
    }
  },
  "樹林": {
    total: 143,
    byType: {
        "自強號": 7,
        "區間快": 35,
        "區間車": 84,
        "莒光號": 4,
        "復興號": 4,
        "普悠瑪": 3,
        "新自強": 6
    }
  },
  "山佳": {
    total: 67,
    byType: {
        "區間車": 67
    }
  },
  "鶯歌": {
    total: 82,
    byType: {
        "區間快": 15,
        "區間車": 67
    }
  },
  "鳳鳴": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "桃園": {
    total: 131,
    byType: {
        "自強號": 21,
        "自強號(新)": 4,
        "區間快": 26,
        "區間車": 67,
        "莒光號": 1,
        "復興號": 4,
        "普悠瑪": 6,
        "新自強": 2
    }
  },
  "內壢": {
    total: 77,
    byType: {
        "區間快": 10,
        "區間車": 67
    }
  },
  "中壢": {
    total: 120,
    byType: {
        "自強號": 18,
        "自強號(新)": 3,
        "區間快": 26,
        "區間車": 67,
        "莒光號": 1,
        "復興號": 4,
        "新自強": 1
    }
  },
  "埔心": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "楊梅": {
    total: 97,
    byType: {
        "自強號": 2,
        "區間快": 24,
        "區間車": 66,
        "莒光號": 1,
        "復興號": 4
    }
  },
  "富岡": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "北湖": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "湖口": {
    total: 93,
    byType: {
        "區間快": 23,
        "區間車": 65,
        "莒光號": 1,
        "復興號": 4
    }
  },
  "新豐": {
    total: 65,
    byType: {
        "區間車": 65
    }
  },
  "竹北": {
    total: 94,
    byType: {
        "自強號": 3,
        "區間快": 24,
        "區間車": 65,
        "莒光號": 1,
        "復興號": 1
    }
  },
  "新竹": {
    total: 152,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 25,
        "區間車": 89,
        "莒光號": 1,
        "復興號": 1,
        "普悠瑪": 7,
        "新自強": 3
    }
  },
  "香山": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "崎頂": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "竹南": {
    total: 101,
    byType: {
        "自強號": 17,
        "自強號(新)": 3,
        "區間快": 15,
        "區間車": 62,
        "莒光號": 1,
        "復興號": 1,
        "新自強": 2
    }
  },
  "談文": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大山": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "後龍": {
    total: 30,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 22,
        "復興號": 1,
        "新自強": 2
    }
  },
  "白沙屯": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "通宵": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "苑裡": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "日南": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "大甲": {
    total: 30,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 22,
        "復興號": 1,
        "新自強": 2
    }
  },
  "台中港": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "清水": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "沙鹿": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "大肚": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "追分": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "造橋": {
    total: 39,
    byType: {
        "區間車": 39
    }
  },
  "苗栗": {
    total: 85,
    byType: {
        "自強號": 15,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 40,
        "莒光號": 1,
        "普悠瑪": 3,
        "新自強": 1
    }
  },
  "銅鑼": {
    total: 44,
    byType: {
        "區間快": 5,
        "區間車": 39
    }
  },
  "三義": {
    total: 44,
    byType: {
        "區間快": 5,
        "區間車": 39
    }
  },
  "后里": {
    total: 89,
    byType: {
        "自強號": 3,
        "區間快": 21,
        "區間車": 64,
        "莒光號": 1
    }
  },
  "豐原": {
    total: 114,
    byType: {
        "自強號": 15,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 63,
        "莒光號": 1,
        "普悠瑪": 8,
        "新自強": 2
    }
  },
  "栗林": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "潭子": {
    total: 69,
    byType: {
        "區間快": 7,
        "區間車": 62
    }
  },
  "松竹": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "太原": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "臺中": {
    total: 125,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 62,
        "莒光號": 1,
        "普悠瑪": 13,
        "新自強": 2
    }
  },
  "五權": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "大慶": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "新烏日": {
    total: 86,
    byType: {
        "自強號": 4,
        "自強號(新)": 2,
        "區間快": 18,
        "區間車": 61,
        "莒光號": 1
    }
  },
  "彰化": {
    total: 150,
    byType: {
        "自強號": 24,
        "自強號(新)": 4,
        "區間快": 24,
        "區間車": 83,
        "莒光號": 1,
        "復興號": 1,
        "普悠瑪": 9,
        "新自強": 4
    }
  },
  "員林": {
    total: 97,
    byType: {
        "自強號": 17,
        "自強號(新)": 2,
        "區間快": 16,
        "區間車": 60,
        "普悠瑪": 1,
        "新自強": 1
    }
  },
  "社頭": {
    total: 61,
    byType: {
        "區間快": 1,
        "區間車": 60
    }
  },
  "田中": {
    total: 77,
    byType: {
        "自強號": 3,
        "區間快": 14,
        "區間車": 60
    }
  },
  "二水": {
    total: 76,
    byType: {
        "區間快": 8,
        "區間車": 68
    }
  },
  "斗六": {
    total: 85,
    byType: {
        "自強號": 18,
        "自強號(新)": 2,
        "區間快": 14,
        "區間車": 50,
        "普悠瑪": 1
    }
  },
  "斗南": {
    total: 71,
    byType: {
        "自強號": 7,
        "區間快": 14,
        "區間車": 50
    }
  },
  "民雄": {
    total: 63,
    byType: {
        "區間快": 14,
        "區間車": 49
    }
  },
  "嘉義": {
    total: 101,
    byType: {
        "自強號": 23,
        "自強號(新)": 2,
        "區間快": 14,
        "區間車": 58,
        "普悠瑪": 4
    }
  },
  "新營": {
    total: 76,
    byType: {
        "自強號": 18,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 44
    }
  },
  "善化": {
    total: 62,
    byType: {
        "自強號": 6,
        "區間快": 12,
        "區間車": 44
    }
  },
  "永康": {
    total: 58,
    byType: {
        "自強號": 2,
        "區間快": 12,
        "區間車": 44
    }
  },
  "臺南": {
    total: 106,
    byType: {
        "自強號": 24,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 63,
        "普悠瑪": 5
    }
  },
  "岡山": {
    total: 77,
    byType: {
        "自強號": 4,
        "區間快": 12,
        "區間車": 61
    }
  },
  "新左營": {
    total: 113,
    byType: {
        "自強號": 20,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 78,
        "普悠瑪": 1
    }
  },
  "高雄": {
    total: 114,
    byType: {
        "自強號": 24,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 71,
        "普悠瑪": 5
    }
  },
  "鳳山": {
    total: 102,
    byType: {
        "自強號": 17,
        "自強號(新)": 2,
        "區間快": 11,
        "區間車": 72
    }
  },
  "九曲堂": {
    total: 72,
    byType: {
        "區間車": 72
    }
  },
  "屏東": {
    total: 116,
    byType: {
        "自強號": 23,
        "自強號(新)": 2,
        "區間快": 11,
        "區間車": 75,
        "普悠瑪": 5
    }
  },
  "西勢": {
    total: 74,
    byType: {
        "區間車": 74
    }
  },
  "潮州": {
    total: 110,
    byType: {
        "自強號": 18,
        "自強號(新)": 2,
        "區間快": 10,
        "區間車": 75,
        "普悠瑪": 5
    }
  },
  "崁頂": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "南州": {
    total: 35,
    byType: {
        "自強號": 5,
        "區間快": 2,
        "區間車": 28
    }
  },
  "鎮安": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "林邊": {
    total: 34,
    byType: {
        "自強號": 4,
        "區間快": 2,
        "區間車": 28
    }
  },
  "佳冬": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "東海": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "枋寮": {
    total: 39,
    byType: {
        "自強號": 8,
        "區間快": 2,
        "區間車": 28,
        "普悠瑪": 1
    }
  }
},
"2023": {
  "臺東": {
    total: 40,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 10
    }
  },
  "山里": {
    total: 18,
    byType: {
        "區間車": 18
    }
  },
  "鹿野": {
    total: 34,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 4
    }
  },
  "瑞源": {
    total: 20,
    byType: {
        "自強號": 2,
        "區間車": 18
    }
  },
  "瑞和": {
    total: 18,
    byType: {
        "區間車": 18
    }
  },
  "關山": {
    total: 34,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "海端": {
    total: 18,
    byType: {
        "區間車": 18
    }
  },
  "池上": {
    total: 36,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "富里": {
    total: 27,
    byType: {
        "自強號": 5,
        "區間車": 18,
        "莒光號": 3,
        "新自強": 1
    }
  },
  "東竹": {
    total: 20,
    byType: {
        "自強號": 2,
        "區間車": 18
    }
  },
  "東里": {
    total: 20,
    byType: {
        "自強號": 2,
        "區間車": 18
    }
  },
  "玉里": {
    total: 52,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間快": 1,
        "區間車": 29,
        "莒光號": 3,
        "新自強": 10
    }
  },
  "三民": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "瑞穗": {
    total: 47,
    byType: {
        "自強號": 7,
        "自強號(新)": 2,
        "區間快": 1,
        "區間車": 28,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "富源": {
    total: 30,
    byType: {
        "自強號": 2,
        "區間車": 28
    }
  },
  "光復": {
    total: 46,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 1,
        "區間車": 29,
        "莒光號": 3,
        "新自強": 6
    }
  },
  "萬榮": {
    total: 34,
    byType: {
        "自強號": 2,
        "區間快": 1,
        "區間車": 29,
        "莒光號": 2
    }
  },
  "鳳林": {
    total: 48,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 3,
        "普悠瑪": 3,
        "新自強": 4
    }
  },
  "南平": {
    total: 29,
    byType: {
        "區間車": 29
    }
  },
  "林榮新光": {
    total: 33,
    byType: {
        "自強號": 4,
        "區間車": 27,
        "莒光號": 1,
        "新自強": 1
    }
  },
  "豐田": {
    total: 30,
    byType: {
        "自強號": 1,
        "區間車": 29
    }
  },
  "壽豐": {
    total: 48,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 3,
        "普悠瑪": 3,
        "新自強": 4
    }
  },
  "平和": {
    total: 29,
    byType: {
        "區間車": 29
    }
  },
  "志學": {
    total: 40,
    byType: {
        "自強號": 4,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 1,
        "普悠瑪": 3,
        "新自強": 1
    }
  },
  "吉安": {
    total: 45,
    byType: {
        "自強號": 5,
        "自強號(新)": 2,
        "區間快": 2,
        "區間車": 29,
        "莒光號": 3,
        "普悠瑪": 3,
        "新自強": 1
    }
  },
  "花蓮": {
    total: 93,
    byType: {
        "自強號": 10,
        "自強號(新)": 4,
        "區間快": 15,
        "區間車": 37,
        "莒光號": 5,
        "普悠瑪": 12,
        "新自強": 10
    }
  },
  "北埔": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "景美": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "新城": {
    total: 41,
    byType: {
        "自強號": 5,
        "區間快": 13,
        "區間車": 19,
        "莒光號": 4
    }
  },
  "崇德": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "和仁": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "和平": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "漢本": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "武塔": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "南澳": {
    total: 45,
    byType: {
        "自強號": 6,
        "區間快": 15,
        "區間車": 19,
        "莒光號": 5
    }
  },
  "東澳": {
    total: 27,
    byType: {
        "自強號": 2,
        "區間快": 6,
        "區間車": 19
    }
  },
  "蘇澳": {
    total: 51,
    byType: {
        "自強號": 5,
        "區間快": 4,
        "區間車": 40,
        "復興號": 2
    }
  },
  "永樂": {
    total: 19,
    byType: {
        "區間車": 19
    }
  },
  "蘇澳新": {
    total: 79,
    byType: {
        "自強號": 7,
        "區間快": 16,
        "區間車": 49,
        "莒光號": 5,
        "復興號": 2
    }
  },
  "冬山": {
    total: 48,
    byType: {
        "區間快": 6,
        "區間車": 38,
        "莒光號": 2,
        "復興號": 2
    }
  },
  "羅東": {
    total: 90,
    byType: {
        "自強號": 8,
        "自強號(新)": 4,
        "區間快": 18,
        "區間車": 38,
        "莒光號": 5,
        "復興號": 3,
        "普悠瑪": 10,
        "新自強": 4
    }
  },
  "中里": {
    total: 38,
    byType: {
        "區間車": 38
    }
  },
  "二結": {
    total: 38,
    byType: {
        "區間車": 38
    }
  },
  "宜蘭": {
    total: 93,
    byType: {
        "自強號": 8,
        "自強號(新)": 4,
        "區間快": 18,
        "區間車": 38,
        "莒光號": 5,
        "復興號": 3,
        "普悠瑪": 11,
        "新自強": 6
    }
  },
  "礁溪": {
    total: 75,
    byType: {
        "自強號": 8,
        "自強號(新)": 2,
        "區間快": 18,
        "區間車": 37,
        "莒光號": 4,
        "復興號": 3,
        "普悠瑪": 2,
        "新自強": 1
    }
  },
  "頂埔": {
    total: 37,
    byType: {
        "區間車": 37
    }
  },
  "頭城": {
    total: 73,
    byType: {
        "自強號": 6,
        "自強號(新)": 2,
        "區間快": 18,
        "區間車": 37,
        "莒光號": 4,
        "復興號": 3,
        "普悠瑪": 2,
        "新自強": 1
    }
  },
  "外澳": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "龜山": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大溪": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大里": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "石城": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "福隆": {
    total: 38,
    byType: {
        "區間快": 11,
        "區間車": 23,
        "莒光號": 2,
        "復興號": 2
    }
  },
  "雙溪": {
    total: 52,
    byType: {
        "自強號": 6,
        "區間快": 17,
        "區間車": 23,
        "莒光號": 3,
        "復興號": 3
    }
  },
  "猴硐": {
    total: 30,
    byType: {
        "區間快": 5,
        "區間車": 23,
        "莒光號": 1,
        "復興號": 1
    }
  },
  "瑞芳": {
    total: 67,
    byType: {
        "自強號": 10,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 23,
        "莒光號": 4,
        "復興號": 5
    }
  },
  "基隆": {
    total: 81,
    byType: {
        "自強號": 5,
        "區間快": 11,
        "區間車": 64,
        "普悠瑪": 1
    }
  },
  "三坑": {
    total: 64,
    byType: {
        "區間車": 64
    }
  },
  "八堵": {
    total: 128,
    byType: {
        "自強號": 11,
        "區間快": 22,
        "區間車": 87,
        "莒光號": 2,
        "復興號": 4,
        "普悠瑪": 2
    }
  },
  "七堵": {
    total: 151,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 30,
        "區間車": 88,
        "莒光號": 4,
        "復興號": 3
    }
  },
  "百福": {
    total: 84,
    byType: {
        "區間車": 84
    }
  },
  "汐止": {
    total: 117,
    byType: {
        "自強號": 2,
        "區間快": 27,
        "區間車": 84,
        "莒光號": 3,
        "復興號": 1
    }
  },
  "汐科": {
    total: 90,
    byType: {
        "區間快": 7,
        "區間車": 84
    }
  },
  "南港": {
    total: 121,
    byType: {
        "自強號": 2,
        "自強號(新)": 3,
        "區間快": 14,
        "區間車": 85,
        "普悠瑪": 9,
        "新自強": 8
    }
  },
  "松山": {
    total: 171,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 36,
        "區間車": 84,
        "莒光號": 4,
        "復興號": 1,
        "普悠瑪": 11,
        "新自強": 9
    }
  },
  "臺北": {
    total: 185,
    byType: {
        "自強號": 26,
        "自強號(新)": 4,
        "區間快": 36,
        "區間車": 84,
        "莒光號": 4,
        "復興號": 5,
        "普悠瑪": 16,
        "新自強": 10
    }
  },
  "萬華": {
    total: 173,
    byType: {
        "自強號": 24,
        "自強號(新)": 4,
        "區間快": 35,
        "區間車": 84,
        "莒光號": 4,
        "復興號": 1,
        "普悠瑪": 12,
        "新自強": 9
    }
  },
  "板橋": {
    total: 179,
    byType: {
        "自強號": 24,
        "自強號(新)": 4,
        "區間快": 35,
        "區間車": 84,
        "莒光號": 4,
        "復興號": 5,
        "普悠瑪": 14,
        "新自強": 9
    }
  },
  "浮洲": {
    total: 83,
    byType: {
        "區間車": 83
    }
  },
  "樹林": {
    total: 143,
    byType: {
        "自強號": 7,
        "區間快": 35,
        "區間車": 84,
        "莒光號": 4,
        "復興號": 4,
        "普悠瑪": 3,
        "新自強": 6
    }
  },
  "山佳": {
    total: 67,
    byType: {
        "區間車": 67
    }
  },
  "鶯歌": {
    total: 82,
    byType: {
        "區間快": 15,
        "區間車": 67
    }
  },
  "鳳鳴": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "桃園": {
    total: 130,
    byType: {
        "自強號": 21,
        "自強號(新)": 4,
        "區間快": 26,
        "區間車": 67,
        "復興號": 4,
        "普悠瑪": 6,
        "新自強": 2
    }
  },
  "內壢": {
    total: 77,
    byType: {
        "區間快": 10,
        "區間車": 67
    }
  },
  "中壢": {
    total: 119,
    byType: {
        "自強號": 18,
        "自強號(新)": 3,
        "區間快": 26,
        "區間車": 67,
        "復興號": 4,
        "新自強": 1
    }
  },
  "埔心": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "楊梅": {
    total: 96,
    byType: {
        "自強號": 2,
        "區間快": 24,
        "區間車": 66,
        "復興號": 4
    }
  },
  "富岡": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "北湖": {
    total: 66,
    byType: {
        "區間車": 66
    }
  },
  "湖口": {
    total: 92,
    byType: {
        "區間快": 23,
        "區間車": 65,
        "復興號": 4
    }
  },
  "新豐": {
    total: 65,
    byType: {
        "區間車": 65
    }
  },
  "竹北": {
    total: 93,
    byType: {
        "自強號": 3,
        "區間快": 24,
        "區間車": 65,
        "復興號": 1
    }
  },
  "新竹": {
    total: 151,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 25,
        "區間車": 89,
        "復興號": 1,
        "普悠瑪": 7,
        "新自強": 3
    }
  },
  "香山": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "崎頂": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "竹南": {
    total: 100,
    byType: {
        "自強號": 17,
        "自強號(新)": 3,
        "區間快": 15,
        "區間車": 62,
        "復興號": 1,
        "新自強": 2
    }
  },
  "談文": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "大山": {
    total: 22,
    byType: {
        "區間車": 22
    }
  },
  "後龍": {
    total: 30,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 22,
        "復興號": 1,
        "新自強": 2
    }
  },
  "白沙屯": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "通宵": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "苑裡": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "日南": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "大甲": {
    total: 30,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 22,
        "復興號": 1,
        "新自強": 2
    }
  },
  "台中港": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "清水": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "沙鹿": {
    total: 29,
    byType: {
        "自強號": 4,
        "區間快": 1,
        "區間車": 21,
        "復興號": 1,
        "新自強": 2
    }
  },
  "大肚": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "追分": {
    total: 21,
    byType: {
        "區間車": 21
    }
  },
  "造橋": {
    total: 39,
    byType: {
        "區間車": 39
    }
  },
  "苗栗": {
    total: 84,
    byType: {
        "自強號": 15,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 40,
        "普悠瑪": 3,
        "新自強": 1
    }
  },
  "銅鑼": {
    total: 44,
    byType: {
        "區間快": 5,
        "區間車": 39
    }
  },
  "三義": {
    total: 44,
    byType: {
        "區間快": 5,
        "區間車": 39
    }
  },
  "后里": {
    total: 88,
    byType: {
        "自強號": 3,
        "區間快": 21,
        "區間車": 64,
    }
  },
  "豐原": {
    total: 113,
    byType: {
        "自強號": 15,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 63,
        "普悠瑪": 8,
        "新自強": 2
    }
  },
  "栗林": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "潭子": {
    total: 69,
    byType: {
        "區間快": 7,
        "區間車": 62
    }
  },
  "松竹": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "太原": {
    total: 62,
    byType: {
        "區間車": 62
    }
  },
  "臺中": {
    total: 124,
    byType: {
        "自強號": 22,
        "自強號(新)": 4,
        "區間快": 21,
        "區間車": 62,
        "普悠瑪": 13,
        "新自強": 2
    }
  },
  "五權": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "大慶": {
    total: 61,
    byType: {
        "區間車": 61
    }
  },
  "新烏日": {
    total: 83,
    byType: {
        "自強號": 2,
        "自強號(新)": 2,
        "區間快": 18,
        "區間車": 61,
    }
  },
  "彰化": {
    total: 149,
    byType: {
        "自強號": 24,
        "自強號(新)": 4,
        "區間快": 24,
        "區間車": 83,
        "復興號": 1,
        "普悠瑪": 9,
        "新自強": 4
    }
  },
  "員林": {
    total: 97,
    byType: {
        "自強號": 17,
        "自強號(新)": 2,
        "區間快": 16,
        "區間車": 60,
        "普悠瑪": 1,
        "新自強": 1
    }
  },
  "社頭": {
    total: 61,
    byType: {
        "區間快": 1,
        "區間車": 60
    }
  },
  "田中": {
    total: 77,
    byType: {
        "自強號": 3,
        "區間快": 14,
        "區間車": 60
    }
  },
  "二水": {
    total: 76,
    byType: {
        "區間快": 8,
        "區間車": 68
    }
  },
  "斗六": {
    total: 85,
    byType: {
        "自強號": 18,
        "自強號(新)": 2,
        "區間快": 14,
        "區間車": 50,
        "普悠瑪": 1
    }
  },
  "斗南": {
    total: 71,
    byType: {
        "自強號": 7,
        "區間快": 14,
        "區間車": 50
    }
  },
  "民雄": {
    total: 63,
    byType: {
        "區間快": 14,
        "區間車": 49
    }
  },
  "嘉義": {
    total: 101,
    byType: {
        "自強號": 23,
        "自強號(新)": 2,
        "區間快": 14,
        "區間車": 58,
        "普悠瑪": 4
    }
  },
  "新營": {
    total: 76,
    byType: {
        "自強號": 18,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 44
    }
  },
  "善化": {
    total: 62,
    byType: {
        "自強號": 6,
        "區間快": 12,
        "區間車": 44
    }
  },
  "永康": {
    total: 58,
    byType: {
        "自強號": 2,
        "區間快": 12,
        "區間車": 44
    }
  },
  "臺南": {
    total: 106,
    byType: {
        "自強號": 24,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 63,
        "普悠瑪": 5
    }
  },
  "岡山": {
    total: 77,
    byType: {
        "自強號": 4,
        "區間快": 12,
        "區間車": 61
    }
  },
  "新左營": {
    total: 113,
    byType: {
        "自強號": 20,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 78,
        "普悠瑪": 1
    }
  },
  "高雄": {
    total: 114,
    byType: {
        "自強號": 24,
        "自強號(新)": 2,
        "區間快": 12,
        "區間車": 71,
        "普悠瑪": 5
    }
  },
  "鳳山": {
    total: 102,
    byType: {
        "自強號": 17,
        "自強號(新)": 2,
        "區間快": 11,
        "區間車": 72
    }
  },
  "九曲堂": {
    total: 72,
    byType: {
        "區間車": 72
    }
  },
  "屏東": {
    total: 116,
    byType: {
        "自強號": 23,
        "自強號(新)": 2,
        "區間快": 11,
        "區間車": 75,
        "普悠瑪": 5
    }
  },
  "西勢": {
    total: 74,
    byType: {
        "區間車": 74
    }
  },
  "潮州": {
    total: 110,
    byType: {
        "自強號": 18,
        "自強號(新)": 2,
        "區間快": 10,
        "區間車": 75,
        "普悠瑪": 5
    }
  },
  "崁頂": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "南州": {
    total: 35,
    byType: {
        "自強號": 5,
        "區間快": 2,
        "區間車": 28
    }
  },
  "鎮安": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "林邊": {
    total: 34,
    byType: {
        "自強號": 4,
        "區間快": 2,
        "區間車": 28
    }
  },
  "佳冬": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "東海": {
    total: 28,
    byType: {
        "區間車": 28
    }
  },
  "枋寮": {
    total: 39,
    byType: {
        "自強號": 8,
        "區間快": 2,
        "區間車": 28,
        "普悠瑪": 1
    }
  }
}
};
